{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "0",
        -2.200156953141171
      ],
      [
        "=",
        -2.364190525802064
      ],
      [
        "-",
        -2.5385796061193844
      ],
      [
        "2",
        -2.6157284960874367
      ],
      [
        "x",
        -2.7568178282718563
      ],
      [
        ".",
        -2.879025906020795
      ],
      [
        "(",
        -3.010430161113778
      ],
      [
        ")",
        -3.0105493675329473
      ],
      [
        "*",
        -3.162237151025735
      ],
      [
        ";",
        -3.2214236367621307
      ],
      [
        "4",
        -3.5408719987202684
      ],
      [
        ":",
        -3.7465668397454337
      ],
      [
        "^",
        -3.7465867496035514
      ],
      [
        "+",
        -3.778154427299242
      ],
      [
        "/",
        -3.97748351483785
      ],
      [
        "D",
        -4.439736418920537
      ],
      [
        "1",
        -4.62926984687733
      ],
      [
        "6",
        -4.699445202707073
      ],
      [
        "5",
        -4.710439826609928
      ],
      [
        "8",
        -4.723366734091636
      ],
      [
        "3",
        -4.747670167838551
      ],
      [
        "7",
        -4.762244031240968
      ],
      [
        "9",
        -4.7710797723030005
      ],

      [
        "n",
        -5.325563090213301
      ],
      [
        "a",
        -6.018674060026701
      ],
      [
        "s",
        -15.534382386812922
      ],
      [
        "u",
        -15.534382386812922
      ],
      [
        "m",
        -15.534382386812922
      ],
      [
        "r",
        -15.53438238681294
      ],
      [
        "i",
        -15.53438238681294
      ],
      [
        "z",
        -15.53438238681294
      ],
      [
        "e",
        -15.53438238681294
      ]
    ]
  }
}