{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "=",
        -2.22639099477899
      ],
      [
        "-",
        -2.3532802109880624
      ],
      [
        "2",
        -2.467423044293369
      ],
      [
        "x",
        -2.570742891366539
      ],
      [
        "(",
        -2.8241791084762973
      ],
      [
        ")",
        -2.9128849616516295
      ],
      [
        "*",
        -2.976154661230968
      ],
      [
        ";",
        -3.035218399711919
      ],
      [
        "0",
        -3.1466656749187383
      ],
      [
        "4",
        -3.405688677357876
      ],
      [
        "^",
        -3.5607118307009085
      ],
      [
        "+",
        -3.5914255269162485
      ],
      [
        "/",
        -3.7911396122610164
      ],
      [
        ",",
        -4.253841536356065
      ],
      [
        "D",
        -4.25386150769719
      ],
      [
        "1",
        -4.5558614963861
      ],
      [
        "5",
        -4.628597645099905
      ],
      [
        "8",
        -4.634609128565705
      ],
      [
        "6",
        -4.636149889100823
      ],
      [
        "3",
        -4.67097290895461
      ],
      [
        "7",
        -4.726653456141177
      ],
      [
        "9",
        -4.756939547126226
      ],
      [
        "10",
        -4.911056381419961
      ],
      [
        "n",
        -5.141495714413832
      ],
      [
        "))=",
        -5.232397999199021
      ],
      [
        "a",
        -5.834703544702199
      ],
      [
        "36",
        -7.94531115804971
      ],
      [
        "160",
        -8.130955253357254
      ],
      [
        "96",
        -8.15772630797213
      ],
      [
        "144",
        -8.22578773236435
      ],
      [
        "76",
        -8.274702417972861
      ],
      [
        "480",
        -8.278776295601023
      ],
      [
        "136",
        -8.286107467333835
      ],
      [
        "300",
        -8.288209207403083
      ],
      [
        "700",
        -8.303365012040127
      ],
      [
        "150",
        -8.304299631632968
      ],
      [
        "16",
        -8.331791618903996
      ],
      [
        "360",
        -8.334235678717608
      ],
      [
        "140",
        -8.344136909330672
      ],
      [
        "180",
        -8.350498100928345
      ],
      [
        "340",
        -8.362204961656696
      ],
      [
        "176",
        -8.368306038819085
      ],
      [
        "168",
        -8.371314808926886
      ],
      [
        "384",
        -8.374895745017536
      ],
      [
        "192",
        -8.384960073497009
      ],
      [
        "120",
        -8.390731311949107
      ],
      [
        "376",
        -8.392272011923962
      ],
      [
        "336",
        -8.39876371245892
      ],
      [
        "112",
        -8.420706111859658
      ],
      [
        "256",
        -8.42946339849972
      ],
      [
        "184",
        -8.430106619103533
      ],
      [
        "320",
        -8.431686412777555
      ],
      [
        "960",
        -8.432255542617597
      ],
      [
        "800",
        -8.432490839717246
      ],
      [
        "504",
        -8.433355113570698
      ],
      [
        "125",
        -8.434399901151199
      ],
      [
        "840",
        -8.434896511113287
      ],
      [
        "380",
        -8.437648105566705
      ],
      [
        "600",
        -8.445584761476525
      ],
      [
        "170",
        -8.449829801276255
      ],
      [
        "196",
        -8.456255867487409
      ],
      [
        "816",
        -8.463309205157682
      ],
      [
        "128",
        -8.467165303198474
      ],
      [
        "288",
        -8.468560372890737
      ],
      [
        "576",
        -8.47135091984558
      ],
      [
        "130",
        -8.472127304548062
      ],
      [
        "900",
        -8.484736031030977
      ],
      [
        "500",
        -8.489034486958161
      ],
      [
        "190",
        -8.503877195751063
      ],
      [
        "400",
        -8.50532845165407
      ],
      [
        "540",
        -8.511880295486684
      ],
      [
        "280",
        -8.51258393073143
      ],
      [
        "720",
        -8.512640937164592
      ],
      [
        "312",
        -8.515035816989027
      ],
      [
        "225",
        -8.520887064865354
      ],
      [
        "496",
        -8.525508567233771
      ],
      [
        "736",
        -8.530017204954019
      ],
      [
        "560",
        -8.53115175944103
      ],
      [
        "328",
        -8.538054887791034
      ],
      [
        "680",
        -8.53979706107565
      ],
      [
        "456",
        -8.539862585426604
      ],
      [
        "784",
        -8.542643166615935
      ],
      [
        "156",
        -8.544699804741224
      ],
      [
        "580",
        -8.546765850711264
      ],
      [
        "656",
        -8.55062278362695
      ],
      [
        "768",
        -8.550979685038927
      ],
      [
        "175",
        -8.558988292533689
      ],
      [
        "368",
        -8.56042609490429
      ],
      [
        "888",
        -8.56409581638516
      ],
      [
        "528",
        -8.565925387436511
      ],
      [
        "608",
        -8.568078689014655
      ],
      [
        "148",
        -8.568887093935174
      ],
      [
        "450",
        -8.569354587621937
      ],
      [
        "648",
        -8.572815133240073
      ],
      [
        "350",
        -8.580394900220805
      ],
      [
        "660",
        -8.583339877193275
      ],
      [
        "116",
        -8.5872967857823
      ],
      [
        "344",
        -8.587385800389363
      ],
      [
        "448",
        -8.587552437452365
      ],
      [
        "860",
        -8.589003568013307
      ],
      [
        "536",
        -8.595788666260784
      ],
      [
        "464",
        -8.5959822730787
      ],
      [
        "396",
        -8.598157128833064
      ],
      [
        "11",
        -8.599969100805321
      ],
      [
        "135",
        -8.600121458309063
      ],
      [
        "848",
        -8.601817661986983
      ],
      [
        "864",
        -8.60352106671633
      ],
      [
        "880",
        -8.613316680821367
      ],
      [
        "208",
        -8.613499035893202
      ],
      [
        "936",
        -8.61522641155452
      ],
      [
        "304",
        -8.620338851049699
      ],
      [
        "896",
        -8.620593979107486
      ],
      [
        "370",
        -8.623212857658952
      ],
      [
        "696",
        -8.644784521183272
      ],
      [
        "980",
        -8.649270600737577
      ],
      [
        "152",
        -8.650627852323439
      ],
      [
        "704",
        -8.65106004144539
      ],
      [
        "126",
        -8.65289009748427
      ],
      [
        "744",
        -8.653660425283444
      ],
      [
        "808",
        -8.65482070941568
      ],
      [
        "575",
        -8.65951996339027
      ],
      [
        "520",
        -8.661570455975827
      ],
      [
        "124",
        -8.666991285062636
      ],
      [
        "270",
        -8.668132542887385
      ],
      [
        "216",
        -8.67119751101503
      ],
      [
        "624",
        -8.675679366055071
      ],
      [
        "756",
        -8.675849491879411
      ],
      [
        "408",
        -8.67703492129305
      ],
      [
        "260",
        -8.67775114234729
      ],
      [
        "912",
        -8.680358571945687
      ],
      [
        "780",
        -8.68080230460951
      ],
      [
        "568",
        -8.683451040765533
      ],
      [
        "920",
        -8.685704015639917
      ],
      [
        "640",
        -8.687366458310084
      ],
      [
        "348",
        -8.68996748510899
      ],
      [
        "672",
        -8.690998191718194
      ],
      [
        "676",
        -8.691806525567603
      ],
      [
        "316",
        -8.695700650728858
      ],
      [
        "760",
        -8.695825001536411
      ],
      [
        "432",
        -8.698313033898618
      ],
      [
        "56",
        -8.698490273901832
      ],
      [
        "146",
        -8.698995072752062
      ],
      [
        "730",
        -8.700275681121969
      ],
      [
        "544",
        -8.703974829072354
      ],
      [
        "430",
        -8.704180269433987
      ],
      [
        "856",
        -8.705205782085693
      ],
      [
        "592",
        -8.708330924239739
      ],
      [
        "740",
        -8.708903343679907
      ],
      [
        "650",
        -8.71000288264267
      ],
      [
        "132",
        -8.710717440522824
      ],
      [
        "516",
        -8.713316053379113
      ],
      [
        "630",
        -8.719444271776668
      ],
      [
        "490",
        -8.720240407842775
      ],
      [
        "378",
        -8.722257283124586
      ],
      [
        "944",
        -8.723841106714689
      ],
      [
        "352",
        -8.724423579550017
      ],
      [
        "178",
        -8.72487416162586
      ],
      [
        "296",
        -8.725287865679771
      ],
      [
        "460",
        -8.726099274839633
      ],
      [
        "324",
        -8.726993667488099
      ],
      [
        "188",
        -8.728670838707997
      ],
      [
        "776",
        -8.730129276882458
      ],
      [
        "250",
        -8.731839214829943
      ],
      [
        "155",
        -8.732489571532259
      ],
      [
        "792",
        -8.735121990472946
      ],
      [
        "199",
        -8.735419237720237
      ],
      [
        "392",
        -8.73614349280345
      ],
      [
        "550",
        -8.736572814677114
      ],
      [
        "688",
        -8.737128535620243
      ],
      [
        "488",
        -8.737985559120522
      ],
      [
        "335",
        -8.738635156446659
      ],
      [
        "870",
        -8.740151293347378
      ],
      [
        "172",
        -8.740164093093364
      ],
      [
        "552",
        -8.741088254366698
      ],
      [
        "118",
        -8.743422701675694
      ],
      [
        "330",
        -8.745442697239891
      ],
      [
        "750",
        -8.745997426421189
      ],
      [
        "616",
        -8.746430867428284
      ],
      [
        "984",
        -8.746927750206353
      ],
      [
        "440",
        -8.74893144980238
      ],
      [
        "154",
        -8.749099660777471
      ],
      [
        "570",
        -8.752724027145153
      ],
      [
        "138",
        -8.753948266784231
      ],
      [
        "416",
        -8.75454422911264
      ],
      [
        "625",
        -8.75808020321773
      ],
      [
        "992",
        -8.760294604647886
      ],
      [
        "770",
        -8.760326061089492
      ],
      [
        "164",
        -8.761121181018197
      ],
      [
        "248",
        -8.76157905028038
      ],
      [
        "850",
        -8.764006996875153
      ],
      [
        "664",
        -8.768942839480513
      ],
      [
        "790",
        -8.770056623491659
      ],
      [
        "264",
        -8.775750504471466
      ],
      [
        "355",
        -8.77722727516894
      ],
      [
        "728",
        -8.777605521601192
      ],
      [
        "596",
        -8.778458995085593
      ],
      [
        "195",
        -8.77973544239811
      ],
      [
        "588",
        -8.786783141433759
      ],
      [
        "308",
        -8.787277124042738
      ],
      [
        "690",
        -8.788589880211543
      ],
      [
        "512",
        -8.788786812848183
      ],
      [
        "584",
        -8.789431406788779
      ],
      [
        "472",
        -8.790916001570864
      ],
      [
        "712",
        -8.790994572028492
      ],
      [
        "108",
        -8.79332078336795
      ],
      [
        "364",
        -8.797909697265858
      ],
      [
        "165",
        -8.801426442315371
      ],
      [
        "675",
        -8.80334515959862
      ],
      [
        "390",
        -8.803958875769139
      ],
      [
        "708",
        -8.810395334978008
      ],
      [
        "375",
        -8.811932627402573
      ],
      [
        "166",
        -8.814706677358162
      ],
      [
        "556",
        -8.815495125416117
      ],
      [
        "117",
        -8.8170658054324
      ],
      [
        "395",
        -8.818868433298196
      ],
      [
        "198",
        -8.819028802739435
      ],
      [
        "186",
        -8.819877571996852
      ],
      [
        "670",
        -8.821796747098976
      ],
      [
        "388",
        -8.82376980937546
      ],
      [
        "508",
        -8.825011464745847
      ],
      [
        "976",
        -8.82654918397548
      ],
      [
        "748",
        -8.828005949436442
      ],
      [
        "159",
        -8.834317460613331
      ],
      [
        "930",
        -8.83823703800051
      ],
      [
        "904",
        -8.840501613020962
      ],
      [
        "387",
        -8.841335170012822
      ],
      [
        "928",
        -8.841675621893433
      ],
      [
        "830",
        -8.84267433191237
      ],
      [
        "306",
        -8.843857298482199
      ],
      [
        "18",
        -8.843936462401587
      ],
      [
        "75",
        -8.845472415842945
      ],
      [
        "177",
        -8.845674000450671
      ],
      [
        "315",
        -8.845778598502731
      ],
      [
        "832",
        -8.84702466219501
      ],
      [
        "868",
        -8.849026593215935
      ],
      [
        "276",
        -8.849502657624445
      ],
      [
        "684",
        -8.849586140979296
      ],
      [
        "470",
        -8.850897842897073
      ],
      [
        "476",
        -8.852185238244877
      ],
      [
        "952",
        -8.852454567062463
      ],
      [
        "564",
        -8.854544301082502
      ],
      [
        "185",
        -8.855167722090567
      ],
      [
        "595",
        -8.855521873806413
      ],
      [
        "836",
        -8.85693349307321
      ],
      [
        "590",
        -8.857744717868894
      ],
      [
        "305",
        -8.861409262072112
      ],
      [
        "956",
        -8.8617621164427
      ],
      [
        "968",
        -8.862176058986373
      ],
      [
        "346",
        -8.863246822594204
      ],
      [
        "468",
        -8.86346052452543
      ],
      [
        "948",
        -8.864673870955453
      ],
      [
        "940",
        -8.86549356442508
      ],
      [
        "119",
        -8.866228277194754
      ],
      [
        "438",
        -8.866380176856634
      ],
      [
        "153",
        -8.86775424570492
      ],
      [
        "990",
        -8.868000291177689
      ],
      [
        "143",
        -8.868988023103835
      ],
      [
        "147",
        -8.869974949472347
      ],
      [
        "294",
        -8.871364460956228
      ],
      [
        "358",
        -8.87298288719732
      ],
      [
        "695",
        -8.875551894758537
      ],
      [
        "828",
        -8.879392935997497
      ],
      [
        "174",
        -8.880219938236836
      ],
      [
        "343",
        -8.881912934800003
      ],
      [
        "189",
        -8.882029531434492
      ],
      [
        "644",
        -8.88215592487688
      ],
      [
        "824",
        -8.882527336970984
      ],
      [
        "775",
        -8.883947445152124
      ],
      [
        "636",
        -8.884518843007712
      ],
      [
        "325",
        -8.884938830111182
      ],
      [
        "916",
        -8.887034066799611
      ],
      [
        "194",
        -8.889010090341399
      ],
      [
        "535",
        -8.88967926724758
      ],
      [
        "319",
        -8.889735431483672
      ],
      [
        "134",
        -8.890724523695502
      ],
      [
        "732",
        -8.89243331511996
      ],
      [
        "158",
        -8.892764296189034
      ],
      [
        "383",
        -8.893571762249119
      ],
      [
        "268",
        -8.896172692839436
      ],
      [
        "534",
        -8.896352508480593
      ],
      [
        "858",
        -8.89864996695239
      ],
      [
        "366",
        -8.899235605078717
      ],
      [
        "996",
        -8.89971330922073
      ],
      [
        "385",
        -8.90134703375299
      ],
      [
        "716",
        -8.901356937611219
      ],
      [
        "445",
        -8.905942734266302
      ],
      [
        "788",
        -8.907397618529485
      ],
      [
        "145",
        -8.908044764548928
      ],
      [
        "574",
        -8.909166489862471
      ],
      [
        "318",
        -8.910186039396322
      ],
      [
        "356",
        -8.910419515174507
      ],
      [
        "532",
        -8.91076301010957
      ],
      [
        "389",
        -8.91460068250262
      ],
      [
        "187",
        -8.915981844304962
      ],
      [
        "872",
        -8.917556111868603
      ],
      [
        "583",
        -8.918483451315645
      ],
      [
        "171",
        -8.920123979495985
      ],
      [
        "548",
        -8.921524191297921
      ],
      [
        "515",
        -8.922658883013753
      ],
      [
        "137",
        -8.922888917359371
      ],
      [
        "157",
        -8.923270406959027
      ],
      [
        "386",
        -8.923782490036103
      ],
      [
        "290",
        -8.92392271541603
      ],
      [
        "133",
        -8.924103286630833
      ],
      [
        "484",
        -8.924327445618918
      ],
      [
        "718",
        -8.92445498058228
      ],
      [
        "950",
        -8.925152800378157
      ],
      [
        "735",
        -8.925266645716018
      ],
      [
        "114",
        -8.925349937693102
      ],
      [
        "774",
        -8.92575361296791
      ],
      [
        "876",
        -8.927087806846918
      ],
      [
        "372",
        -8.92726757637024
      ],
      [
        "418",
        -8.9285824763124
      ],
      [
        "169",
        -8.928779207831102
      ],
      [
        "167",
        -8.929406664602947
      ],
      [
        "351",
        -8.93009697360353
      ],
      [
        "334",
        -8.930872466533955
      ],
      [
        "646",
        -8.930913986592707
      ],
      [
        "798",
        -8.931458463370035
      ],
      [
        "632",
        -8.932216255573117
      ],
      [
        "620",
        -8.93224705178595
      ],
      [
        "406",
        -8.933159372635306
      ],
      [
        "486",
        -8.933965121180746
      ],
      [
        "339",
        -8.934145540503517
      ],
      [
        "349",
        -8.934442545971821
      ],
      [
        "191",
        -8.93477239327236
      ],
      [
        "558",
        -8.935466815863133
      ],
      [
        "332",
        -8.936253772902639
      ],
      [
        "183",
        -8.936716637314575
      ],
      [
        "123",
        -8.93748270562694
      ],
      [
        "530",
        -8.937888729660255
      ],
      [
        "436",
        -8.938949117829303
      ],
      [
        "111",
        -8.939302389623276
      ],
      [
        "495",
        -8.941001456670019
      ],
      [
        "555",
        -8.942252448976806
      ],
      [
        "668",
        -8.944782381970402
      ],
      [
        "605",
        -8.944832693027115
      ],
      [
        "852",
        -8.945303230947054
      ],
      [
        "303",
        -8.946408553943673
      ],
      [
        "68",
        -8.94741274478297
      ],
      [
        "331",
        -8.948159805791036
      ],
      [
        "890",
        -8.94893956426204
      ],
      [
        "286",
        -8.950472993134124
      ],
      [
        "365",
        -8.950979244146563
      ],
      [
        "612",
        -8.952892727286574
      ],
      [
        "908",
        -8.953263818654612
      ],
      [
        "844",
        -8.954202807383602
      ],
      [
        "15",
        -8.954939686458232
      ],
      [
        "115",
        -8.956592841835702
      ],
      [
        "655",
        -8.95741550886876
      ],
      [
        "435",
        -8.958680416638181
      ],
      [
        "327",
        -8.96003331277489
      ],
      [
        "875",
        -8.963197742592186
      ],
      [
        "725",
        -8.965140510669883
      ],
      [
        "329",
        -8.965201965246647
      ],
      [
        "538",
        -8.967190382156666
      ],
      [
        "572",
        -8.969377458584706
      ],
      [
        "230",
        -8.97183887533679
      ],
      [
        "179",
        -8.972273233715907
      ],
      [
        "815",
        -8.972489507113227
      ],
      [
        "399",
        -8.97443442710664
      ],
      [
        "628",
        -8.976914148140224
      ],
      [
        "826",
        -8.977070200938238
      ],
      [
        "606",
        -8.977958555965696
      ],
      [
        "121",
        -8.978512583136093
      ],
      [
        "845",
        -8.978899332174823
      ],
      [
        "619",
        -8.97952793910924
      ],
      [
        "141",
        -8.981242565907449
      ],
      [
        "311",
        -8.981291588854955
      ],
      [
        "369",
        -8.981989816419553
      ],
      [
        "139",
        -8.983227620518772
      ],
      [
        "884",
        -8.983380234889093
      ],
      [
        "635",
        -8.983917538678341
      ],
      [
        "88",
        -8.984047663055684
      ],
      [
        "151",
        -8.984840417152238
      ],
      [
        "946",
        -8.985009809129119
      ],
      [
        "371",
        -8.985207194147652
      ],
      [
        "161",
        -8.986385446232003
      ],
      [
        "738",
        -8.987081079216564
      ],
      [
        "345",
        -8.98719901058961
      ],
      [
        "594",
        -8.988244491232075
      ],
      [
        "855",
        -8.9885771311367
      ],
      [
        "799",
        -8.988724559965007
      ],
      [
        "820",
        -8.989265058768385
      ],
      [
        "559",
        -8.989360074349701
      ],
      [
        "466",
        -8.990567996839857
      ],
      [
        "546",
        -8.991945099229284
      ],
      [
        "988",
        -8.992624117695936
      ],
      [
        "478",
        -8.99336261093081
      ],
      [
        "359",
        -8.99342846893424
      ],
      [
        "618",
        -8.994834319821347
      ],
      [
        "131",
        -8.996697892614533
      ],
      [
        "326",
        -8.997535085821319
      ],
      [
        "333",
        -9.002885116793564
      ],
      [
        "338",
        -9.00475281626846
      ],
      [
        "654",
        -9.005824828198367
      ],
      [
        "475",
        -9.006010443462166
      ],
      [
        "652",
        -9.007689283963586
      ],
      [
        "285",
        -9.009301433984334
      ],
      [
        "567",
        -9.00993715422694
      ],
      [
        "258",
        -9.010176657813162
      ],
      [
        "163",
        -9.010203356186663
      ],
      [
        "714",
        -9.01027433475555
      ],
      [
        "162",
        -9.010473260672516
      ],
      [
        "764",
        -9.011927898440385
      ],
      [
        "886",
        -9.012304521068298
      ],
      [
        "889",
        -9.013157033536626
      ],
      [
        "511",
        -9.014767511453893
      ],
      [
        "129",
        -9.014937517696474
      ],
      [
        "954",
        -9.0153599805426
      ],
      [
        "525",
        -9.015733021435622
      ],
      [
        "526",
        -9.018005813558432
      ],
      [
        "207",
        -9.018253814879792
      ],
      [
        "391",
        -9.018391023320756
      ],
      [
        "578",
        -9.018796897024218
      ],
      [
        "752",
        -9.019309807119516
      ],
      [
        "804",
        -9.020644683798842
      ],
      [
        "298",
        -9.02175817114052
      ],
      [
        "498",
        -9.022383159582741
      ],
      [
        "614",
        -9.02246562384867
      ],
      [
        "236",
        -9.023183983712896
      ],
      [
        "471",
        -9.024409730937993
      ],
      [
        "585",
        -9.026115899646555
      ],
      [
        "142",
        -9.026316842714643
      ],
      [
        "505",
        -9.026888711908418
      ],
      [
        "663",
        -9.026895554081612
      ],
      [
        "970",
        -9.02760410711427
      ],
      [
        "238",
        -9.029395982985355
      ],
      [
        "503",
        -9.029506103000553
      ],
      [
        "444",
        -9.03199462512693
      ],
      [
        "755",
        -9.03217332752663
      ],
      [
        "255",
        -9.034614052791586
      ],
      [
        "839",
        -9.035736416291105
      ],
      [
        "645",
        -9.035794139614463
      ],
      [
        "599",
        -9.037363362772242
      ],
      [
        "127",
        -9.038167122882466
      ],
      [
        "367",
        -9.039566043707143
      ],
      [
        "892",
        -9.040372775083291
      ],
      [
        "905",
        -9.040544085283056
      ],
      [
        "284",
        -9.040813412481867
      ],
      [
        "357",
        -9.040976107487388
      ],
      [
        "354",
        -9.041244133677136
      ],
      [
        "193",
        -9.041445497445089
      ],
      [
        "205",
        -9.041829941855545
      ],
      [
        "975",
        -9.042589372079119
      ],
      [
        "373",
        -9.043236070632961
      ],
      [
        "674",
        -9.043729528162734
      ],
      [
        "958",
        -9.04381778657436
      ],
      [
        "321",
        -9.04456840340298
      ],
      [
        "747",
        -9.044747130867403
      ],
      [
        "317",
        -9.044755687061922
      ],
      [
        "763",
        -9.04480891971673
      ],
      [
        "463",
        -9.044844431048045
      ],
      [
        "972",
        -9.045389054994246
      ],
      [
        "791",
        -9.046744096992668
      ],
      [
        "377",
        -9.046864996845112
      ],
      [
        "527",
        -9.047280556635481
      ],
      [
        "149",
        -9.04778374551963
      ],
      [
        "805",
        -9.047903229961214
      ],
      [
        "455",
        -9.049216154500543
      ],
      [
        "692",
        -9.050965195660368
      ],
      [
        "643",
        -9.051408709539352
      ],
      [
        "173",
        -9.051681808914203
      ],
      [
        "234",
        -9.051683439013846
      ],
      [
        "363",
        -9.052424736589051
      ],
      [
        "539",
        -9.053478503149375
      ],
      [
        "814",
        -9.054343987206712
      ],
      [
        "457",
        -9.054712804606208
      ],
      [
        "601",
        -9.055124769932974
      ],
      [
        "507",
        -9.057278358013303
      ],
      [
        "978",
        -9.058408447291576
      ],
      [
        "289",
        -9.060624927619479
      ],
      [
        "687",
        -9.061128257691815
      ],
      [
        "779",
        -9.062178894737427
      ],
      [
        "353",
        -9.062990164524793
      ],
      [
        "745",
        -9.063525826538353
      ],
      [
        "492",
        -9.064138792986041
      ],
      [
        "197",
        -9.065202637651751
      ],
      [
        "765",
        -9.065786925000259
      ],
      [
        "283",
        -9.066607818040005
      ],
      [
        "506",
        -9.06706269691107
      ],
      [
        "267",
        -9.067354812033376
      ],
      [
        "918",
        -9.06774558150516
      ],
      [
        "307",
        -9.068825245158482
      ],
      [
        "531",
        -9.068997856256605
      ],
      [
        "607",
        -9.069184613271633
      ],
      [
        "637",
        -9.069431269966154
      ],
      [
        "767",
        -9.070718194822867
      ],
      [
        "551",
        -9.071286849529855
      ],
      [
        "938",
        -9.0734350956963
      ],
      [
        "547",
        -9.074116349634917
      ],
      [
        "235",
        -9.074537862251663
      ],
      [
        "709",
        -9.074690026120088
      ],
      [
        "519",
        -9.07485752158726
      ],
      [
        "459",
        -9.075003664323145
      ],
      [
        "415",
        -9.076820955487566
      ],
      [
        "113",
        -9.077659546824346
      ],
      [
        "405",
        -9.08036176461023
      ],
      [
        "846",
        -9.080423536617923
      ],
      [
        "314",
        -9.080675762840505
      ],
      [
        "301",
        -9.08157409444491
      ],
      [
        "524",
        -9.081922955177719
      ],
      [
        "295",
        -9.083304954191904
      ],
      [
        "964",
        -9.083594899127974
      ],
      [
        "769",
        -9.083687880745876
      ],
      [
        "627",
        -9.083871007683111
      ],
      [
        "409",
        -9.083990670887257
      ],
      [
        "382",
        -9.084041936352921
      ],
      [
        "361",
        -9.085451868358948
      ],
      [
        "754",
        -9.086099422698727
      ],
      [
        "658",
        -9.086195339802709
      ],
      [
        "279",
        -9.088066997948927
      ],
      [
        "563",
        -9.088682965761603
      ],
      [
        "485",
        -9.089019944119565
      ],
      [
        "543",
        -9.090095723212825
      ],
      [
        "394",
        -9.090212794319516
      ],
      [
        "379",
        -9.090607546666295
      ],
      [
        "945",
        -9.09065296398606
      ],
      [
        "999",
        -9.090914471701144
      ],
      [
        "932",
        -9.091391758822208
      ],
      [
        "182",
        -9.094325689612674
      ],
      [
        "454",
        -9.094653759556273
      ],
      [
        "1000",
        -9.094688737393966
      ],
      [
        "995",
        -9.095396243649557
      ],
      [
        "678",
        -9.096155658575318
      ],
      [
        "772",
        -9.097061813701018
      ],
      [
        "309",
        -9.097521966252433
      ],
      [
        "746",
        -9.097618004690306
      ],
      [
        "795",
        -9.097700382375477
      ],
      [
        "909",
        -9.097700515175289
      ],
      [
        "895",
        -9.098066691312571
      ],
      [
        "518",
        -9.098179929266824
      ],
      [
        "665",
        -9.098471727661565
      ],
      [
        "439",
        -9.099719230363483
      ],
      [
        "337",
        -9.09977450727068
      ],
      [
        "586",
        -9.100603798292628
      ],
      [
        "381",
        -9.100735598304222
      ],
      [
        "758",
        -9.101043208073687
      ],
      [
        "323",
        -9.101435068320047
      ],
      [
        "557",
        -9.101922759700642
      ],
      [
        "786",
        -9.102250783591595
      ],
      [
        "683",
        -9.102674642322924
      ],
      [
        "679",
        -9.104399772758196
      ],
      [
        "924",
        -9.104684373181728
      ],
      [
        "487",
        -9.104835006837085
      ],
      [
        "796",
        -9.105767007282992
      ],
      [
        "651",
        -9.10644549931699
      ],
      [
        "669",
        -9.106826199718462
      ],
      [
        "703",
        -9.10770572533724
      ],
      [
        "577",
        -9.108661417769788
      ],
      [
        "611",
        -9.109757216858718
      ],
      [
        "835",
        -9.110121133364656
      ],
      [
        "667",
        -9.110678603120213
      ],
      [
        "715",
        -9.111174906960041
      ],
      [
        "259",
        -9.11147939489333
      ],
      [
        "689",
        -9.112093495628134
      ],
      [
        "428",
        -9.114497372980331
      ],
      [
        "414",
        -9.115036070782175
      ],
      [
        "565",
        -9.115610476678718
      ],
      [
        "374",
        -9.116224856413947
      ],
      [
        "501",
        -9.116636434471403
      ],
      [
        "569",
        -9.11666020716563
      ],
      [
        "623",
        -9.1173391423132
      ],
      [
        "545",
        -9.117738779970026
      ],
      [
        "541",
        -9.117744090817059
      ],
      [
        "849",
        -9.1178176731264
      ],
      [
        "274",
        -9.1203564307635
      ],
      [
        "514",
        -9.120451738506892
      ],
      [
        "467",
        -9.12235852891406
      ],
      [
        "458",
        -9.124735960612716
      ],
      [
        "838",
        -9.124814593742038
      ],
      [
        "694",
        -9.124817676928767
      ],
      [
        "469",
        -9.125139810307173
      ],
      [
        "275",
        -9.125612968703926
      ],
      [
        "812",
        -9.12585177243096
      ],
      [
        "587",
        -9.125950201750378
      ],
      [
        "604",
        -9.126369627958562
      ],
      [
        "647",
        -9.126611132240335
      ],
      [
        "743",
        -9.12768242841203
      ],
      [
        "441",
        -9.129243767024
      ],
      [
        "313",
        -9.129352651124627
      ],
      [
        "898",
        -9.130173481609438
      ],
      [
        "729",
        -9.131311439005309
      ],
      [
        "529",
        -9.13171542116569
      ],
      [
        "705",
        -9.131983552771548
      ],
      [
        "906",
        -9.132376278200578
      ],
      [
        "934",
        -9.133388497753408
      ],
      [
        "685",
        -9.133672121853671
      ],
      [
        "671",
        -9.134259019038874
      ],
      [
        "347",
        -9.134327418215264
      ],
      [
        "549",
        -9.134674987718173
      ],
      [
        "493",
        -9.135119837116296
      ],
      [
        "751",
        -9.135600326514759
      ],
      [
        "726",
        -9.13578996323446
      ],
      [
        "723",
        -9.135914719661201
      ],
      [
        "403",
        -9.136208747238182
      ],
      [
        "398",
        -9.136897252888119
      ],
      [
        "686",
        -9.13940857913856
      ],
      [
        "926",
        -9.139696936071573
      ],
      [
        "883",
        -9.13996935085433
      ],
      [
        "603",
        -9.141434805833768
      ],
      [
        "666",
        -9.14187996189642
      ],
      [
        "231",
        -9.14218416128399
      ],
      [
        "807",
        -9.142679283791935
      ],
      [
        "787",
        -9.143427858542395
      ],
      [
        "691",
        -9.144006938721379
      ],
      [
        "237",
        -9.145409502599541
      ],
      [
        "851",
        -9.146431654460093
      ],
      [
        "639",
        -9.14698651623952
      ],
      [
        "465",
        -9.148007708125464
      ],
      [
        "657",
        -9.148205615968338
      ],
      [
        "947",
        -9.14833300780811
      ],
      [
        "653",
        -9.149176966897926
      ],
      [
        "819",
        -9.149479513710387
      ],
      [
        "181",
        -9.15023916108572
      ],
      [
        "943",
        -9.151101986222415
      ],
      [
        "673",
        -9.152357193844425
      ],
      [
        "434",
        -9.153173348216976
      ],
      [
        "706",
        -9.154103877646957
      ],
      [
        "554",
        -9.155040625075609
      ],
      [
        "903",
        -9.155475481122753
      ],
      [
        "935",
        -9.15697961384436
      ],
      [
        "553",
        -9.157105180729776
      ],
      [
        "566",
        -9.157499425737555
      ],
      [
        "265",
        -9.15792165048327
      ],
      [
        "342",
        -9.159071780428523
      ],
      [
        "246",
        -9.15916508466913
      ],
      [
        "921",
        -9.16093556619493
      ],
      [
        "631",
        -9.161256914522479
      ],
      [
        "891",
        -9.161914179552308
      ],
      [
        "78",
        -9.1621385120966
      ],
      [
        "781",
        -9.16341465202482
      ],
      [
        "483",
        -9.163495624461984
      ],
      [
        "582",
        -9.164810198637852
      ],
      [
        "598",
        -9.165890572166408
      ],
      [
        "991",
        -9.166350368319897
      ],
      [
        "561",
        -9.167202668198566
      ],
      [
        "571",
        -9.167810499634761
      ],
      [
        "699",
        -9.168272778356894
      ],
      [
        "239",
        -9.16911364392401
      ],
      [
        "634",
        -9.171104814687059
      ],
      [
        "698",
        -9.171308536997895
      ],
      [
        "783",
        -9.171373375025935
      ],
      [
        "887",
        -9.171979826513272
      ],
      [
        "925",
        -9.172040354984933
      ],
      [
        "591",
        -9.172343036515166
      ],
      [
        "778",
        -9.17587547893631
      ],
      [
        "927",
        -9.175892732566748
      ],
      [
        "397",
        -9.17599093014433
      ],
      [
        "831",
        -9.176640248533609
      ],
      [
        "871",
        -9.178304951899314
      ],
      [
        "489",
        -9.179200946092937
      ],
      [
        "638",
        -9.18049304641767
      ],
      [
        "287",
        -9.181489293153598
      ],
      [
        "915",
        -9.181607064241348
      ],
      [
        "626",
        -9.181631782390149
      ],
      [
        "299",
        -9.181752515171649
      ],
      [
        "589",
        -9.1824070497001
      ],
      [
        "759",
        -9.182866535743624
      ],
      [
        "711",
        -9.183664142223083
      ],
      [
        "452",
        -9.184226970159376
      ],
      [
        "707",
        -9.1842770170086
      ],
      [
        "499",
        -9.185509913428316
      ],
      [
        "939",
        -9.185545961471052
      ],
      [
        "641",
        -9.18586167273105
      ],
      [
        "894",
        -9.185992653210011
      ],
      [
        "818",
        -9.18637443433022
      ],
      [
        "985",
        -9.186601807208445
      ],
      [
        "766",
        -9.187085909298833
      ],
      [
        "719",
        -9.187334843520421
      ],
      [
        "509",
        -9.187454882925834
      ],
      [
        "245",
        -9.18780613725728
      ],
      [
        "431",
        -9.188477557886454
      ],
      [
        "982",
        -9.188839145100776
      ],
      [
        "579",
        -9.188893356591489
      ],
      [
        "893",
        -9.189471662643633
      ],
      [
        "273",
        -9.189547117316987
      ],
      [
        "461",
        -9.19035441491122
      ],
      [
        "393",
        -9.191359777109167
      ],
      [
        "959",
        -9.191732224215382
      ],
      [
        "597",
        -9.192004799589153
      ],
      [
        "847",
        -9.192329127138308
      ],
      [
        "825",
        -9.19289741232647
      ],
      [
        "443",
        -9.193143654798845
      ],
      [
        "473",
        -9.194259844696315
      ],
      [
        "98",
        -9.195049463729717
      ],
      [
        "923",
        -9.197165253432377
      ],
      [
        "983",
        -9.197330378645052
      ],
      [
        "218",
        -9.199853037316986
      ],
      [
        "734",
        -9.201026385818214
      ],
      [
        "843",
        -9.202156790322928
      ],
      [
        "827",
        -9.202366356691584
      ],
      [
        "659",
        -9.202436720913724
      ],
      [
        "986",
        -9.203609090254126
      ],
      [
        "446",
        -9.204371192284015
      ],
      [
        "865",
        -9.204645618102417
      ],
      [
        "997",
        -9.205792568986361
      ],
      [
        "771",
        -9.206167649900404
      ],
      [
        "727",
        -9.208356844074267
      ],
      [
        "837",
        -9.209043685698939
      ],
      [
        "761",
        -9.20923382517077
      ],
      [
        "297",
        -9.210184597079156
      ],
      [
        "79",
        -9.2122016093764
      ],
      [
        "278",
        -9.21233484300596
      ],
      [
        "966",
        -9.212738496772637
      ],
      [
        "907",
        -9.214105284981219
      ],
      [
        "803",
        -9.214106370601414
      ],
      [
        "269",
        -9.215177025909078
      ],
      [
        "879",
        -9.215578699499277
      ],
      [
        "885",
        -9.216260038898685
      ],
      [
        "271",
        -9.217052543607029
      ],
      [
        "105",
        -9.217348039868893
      ],
      [
        "417",
        -9.217454371978517
      ],
      [
        "937",
        -9.218022656711739
      ],
      [
        "251",
        -9.218029715573518
      ],
      [
        "859",
        -9.218187982333793
      ],
      [
        "649",
        -9.219615711000873
      ],
      [
        "233",
        -9.219929371029714
      ],
      [
        "291",
        -9.221647014953152
      ],
      [
        "617",
        -9.221960055553819
      ],
      [
        "66",
        -9.222964862920122
      ],
      [
        "517",
        -9.224918360986177
      ],
      [
        "479",
        -9.225959837368764
      ],
      [
        "433",
        -9.225967673045751
      ],
      [
        "257",
        -9.22740047340665
      ],
      [
        "834",
        -9.228939032891086
      ],
      [
        "963",
        -9.229059661928822
      ],
      [
        "449",
        -9.229486691153134
      ],
      [
        "681",
        -9.229684819544378
      ],
      [
        "451",
        -9.230883923171469
      ],
      [
        "537",
        -9.232838114863576
      ],
      [
        "773",
        -9.23316380174842
      ],
      [
        "806",
        -9.234472979185881
      ],
      [
        "693",
        -9.235148625589947
      ],
      [
        "453",
        -9.23539224219783
      ],
      [
        "823",
        -9.236395731781283
      ],
      [
        "878",
        -9.237123895529852
      ],
      [
        "949",
        -9.239254454870483
      ],
      [
        "721",
        -9.239568987141078
      ],
      [
        "419",
        -9.241462224279255
      ],
      [
        "882",
        -9.242087863816598
      ],
      [
        "737",
        -9.2425501508746
      ],
      [
        "785",
        -9.24510277640977
      ],
      [
        "874",
        -9.245453042062064
      ],
      [
        "794",
        -9.245536226482997
      ],
      [
        "731",
        -9.245731229940626
      ],
      [
        "217",
        -9.246050830988136
      ],
      [
        "854",
        -9.24607863220499
      ],
      [
        "581",
        -9.246551815994078
      ],
      [
        "413",
        -9.247757917965231
      ],
      [
        "513",
        -9.248062354491761
      ],
      [
        "99",
        -9.248108397610672
      ],
      [
        "615",
        -9.248405034901282
      ],
      [
        "866",
        -9.249254265369144
      ],
      [
        "961",
        -9.249272639415604
      ],
      [
        "293",
        -9.249472986799205
      ],
      [
        "753",
        -9.250114816448125
      ],
      [
        "987",
        -9.250323968204775
      ],
      [
        "777",
        -9.250827974388532
      ],
      [
        "63",
        -9.25173162699895
      ],
      [
        "867",
        -9.252344887576193
      ],
      [
        "862",
        -9.252825918864112
      ],
      [
        "914",
        -9.253421327378728
      ],
      [
        "899",
        -9.254543841508145
      ],
      [
        "989",
        -9.257017764207468
      ],
      [
        "877",
        -9.257214080536908
      ],
      [
        "266",
        -9.257280506104863
      ],
      [
        "955",
        -9.257439022093603
      ],
      [
        "477",
        -9.257866500091717
      ],
      [
        "474",
        -9.25874106024892
      ],
      [
        "919",
        -9.259086971478002
      ],
      [
        "697",
        -9.259741264549511
      ],
      [
        "494",
        -9.260055976660844
      ],
      [
        "341",
        -9.260692406912572
      ],
      [
        "809",
        -9.262784253895795
      ],
      [
        "277",
        -9.265467228577918
      ],
      [
        "931",
        -9.265770266345795
      ],
      [
        "817",
        -9.269199578926749
      ],
      [
        "861",
        -9.272616950789875
      ],
      [
        "633",
        -9.273472495168402
      ],
      [
        "521",
        -9.274530816726145
      ],
      [
        "739",
        -9.2753158175619
      ],
      [
        "933",
        -9.277964680191241
      ],
      [
        "661",
        -9.27971341432435
      ],
      [
        "979",
        -9.281534929155558
      ],
      [
        "811",
        -9.281678216319218
      ],
      [
        "437",
        -9.281840255541319
      ],
      [
        "801",
        -9.282002833568475
      ],
      [
        "219",
        -9.282196233282026
      ],
      [
        "911",
        -9.283325607203256
      ],
      [
        "749",
        -9.287017244192112
      ],
      [
        "613",
        -9.287887510306632
      ],
      [
        "757",
        -9.288121647166236
      ],
      [
        "39",
        -9.289278145126442
      ],
      [
        "965",
        -9.290292585349178
      ],
      [
        "497",
        -9.290658975657326
      ],
      [
        "682",
        -9.293774549301055
      ],
      [
        "215",
        -9.293975953366719
      ],
      [
        "621",
        -9.295089495658571
      ],
      [
        "281",
        -9.297367830862202
      ],
      [
        "717",
        -9.297476738809287
      ],
      [
        "897",
        -9.29783782594627
      ],
      [
        "967",
        -9.298627242270221
      ],
      [
        "662",
        -9.298855528351886
      ],
      [
        "793",
        -9.298932536728444
      ],
      [
        "407",
        -9.299581246799926
      ],
      [
        "213",
        -9.299738690045162
      ],
      [
        "523",
        -9.299877798256492
      ],
      [
        "724",
        -9.30154668253273
      ],
      [
        "977",
        -9.302028281675433
      ],
      [
        "857",
        -9.303932096682574
      ],
      [
        "491",
        -9.305099658721431
      ],
      [
        "481",
        -9.305530443481546
      ],
      [
        "573",
        -9.305974723375819
      ],
      [
        "609",
        -9.306934015539296
      ],
      [
        "974",
        -9.307412851180331
      ],
      [
        "593",
        -9.314368689953968
      ],
      [
        "863",
        -9.324229377702729
      ],
      [
        "873",
        -9.32540015385921
      ],
      [
        "249",
        -9.326071217436528
      ],
      [
        "401",
        -9.327018601949302
      ],
      [
        "87",
        -9.328295795551988
      ],
      [
        "969",
        -9.330517960052333
      ],
      [
        "261",
        -9.332237300780218
      ],
      [
        "813",
        -9.332419424187652
      ],
      [
        "869",
